public_html/readeck.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>readeck</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">readeck</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgec62470">1. Docker compose original</a></li>
<li><a href="#orgb0ff5ec">2. Docker compose modificado (Guardar datos en "~/dockers/readeck/data/"</a></li>
</ul>
</div>
</div>
<p>
<a href="https://readeck.org/en/">https://readeck.org/en/</a>
</p>

<div id="outline-container-orgec62470" class="outline-2">
<h2 id="orgec62470"><span class="section-number-2">1.</span> Docker compose original</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #cae682;">version</span>: <span style="color: #95e454;">'3.8'</span>
<span style="color: #cae682;">services</span>:
  <span style="color: #cae682;">readeck</span>:
    <span style="color: #cae682;">image</span>: codeberg.org/readeck/readeck:latest
    <span style="color: #cae682;">container_name</span>: readeck
    <span style="color: #cae682;">ports</span>:
      - <span style="color: #95e454;">"8000:8000"</span>
    <span style="color: #cae682;">volumes</span>:
      - readeck-data:/readeck
    <span style="color: #cae682;">restart</span>: unless-stopped
<span style="color: #cae682;">volumes</span>:
  <span style="color: #cae682;">readeck-data</span>:
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb0ff5ec" class="outline-2">
<h2 id="orgb0ff5ec"><span class="section-number-2">2.</span> Docker compose modificado (Guardar datos en "~/dockers/readeck/data/"</h2>
<div class="outline-text-2" id="text-2">
<p>
Copiar archivos de configuración de la ubicación original a la nueva y modificar los permisos para el usuario, parar y volver arrancar el contenedor.
</p>

<div class="org-src-container">
<pre class="src src-bash">docker cp readeck:/readeck/data/. ~/dockers/readeck/data/
sudo chown -R sherlockes:sherlockes ~/dockers/readeck/data
docker compose down
</pre>
</div>

<p>
Modificar el archivo "docker-compose.yml"
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #cae682;">services</span>:
  <span style="color: #cae682;">readeck</span>:
    <span style="color: #cae682;">image</span>: codeberg.org/readeck/readeck:latest
    <span style="color: #cae682;">container_name</span>: readeck
    <span style="color: #cae682;">ports</span>:
      - <span style="color: #95e454;">"8000:8000"</span>
    <span style="color: #cae682;">volumes</span>:
      - $HOME/dockers/readeck/data:/readeck/data
    <span style="color: #cae682;">restart</span>: unless-stopped
</pre>
</div>

<p>
Arrancar de nuevo el contenedor
</p>

<div class="org-src-container">
<pre class="src src-bash">docker compose up -d
</pre>
</div>

<p>
Ahora ya tenemos los datos de Readeck en "~/dockers/readeck/data/"
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-02-10</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
